БылковДА_70180166/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</name>
  <basedOn>Document.НаправлениеНаПересдачу</basedOn>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РольВКомиссии</name>
    <type>
      <types>EnumRef.РольВКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.НаправлениеНаПересдачу</types>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийБилет</name>
    <type>
      <types>CatalogRef.СтуденческиеБилеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>EnumRef.Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансирования</name>
    <type>
      <types>EnumRef.ВидыФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРасмотрения</name>
    <type>
      <types>EnumRef.СтатусРассмотрения</types>
    </type>
  </attributes>
</mdclass:Catalog>

БылковДА_70180166/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ObjectModule.bsl
&НаСервере
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
  Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НаправлениеНаПересдачу") Тогда
    // Заполнение шапки
    ЭтотОбъект.Дисциплина = ДанныеЗаполнения.Дисциплина;
    ЭтотОбъект.Преподаватель = ДанныеЗаполнения.Преподаватель;
    ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
    ЭтотОбъект.Студент = ДанныеЗаполнения.Студент;
    ЭтотОбъект.Факультет = ДанныеЗаполнения.Факультет;
    
    // Получаем данные о семестре студента из справочника
    Если ЗначениеЗаполнено(ДанныеЗаполнения.Студент) Тогда
      Запрос = Новый Запрос;
      Запрос.Текст = 
      "ВЫБРАТЬ
      |  Студенты.Семестр КАК Семестр
      |ИЗ
      |  Справочник.Студенты КАК Студенты
      |ГДЕ
      |  Студенты.Ссылка = &СсылкаНаСтудента";
      
      Запрос.УстановитьПараметр("СсылкаНаСтудента", ДанныеЗаполнения.Студент);
      Результат = Запрос.Выполнить();
      Выборка = Результат.Выбрать();
      
      Если Выборка.Следующий() Тогда
        ЭтотОбъект.Семестр = Выборка.Семестр;
      КонецЕсли;
    КонецЕсли;
  КонецЕсли;
КонецПроцедуры
